
/**
 * 太极生两仪（阴阳），两仪生四象（少阳，老阳，少阴，老阴），四象生八卦（乾，坤，震，巽，坎，离，艮，兑），八卦生六十四卦
 */
const taiji = {
    symbol:'o',
    children:[
      {
        yangyao:{
          symbol:'---',//天，昼，男
          children:[
            {
              laoyang:{
                symbol:['---',
                        '---'],//老阳，但表夏，南，朱雀
                children:[
                  {
                    symbol:['---',
                            '---',
                            '---']// 乾三连，代表天，父，西北
                  },
                  {
                    symbol:['---',
                            '---',
                            '- - ']//巽（xun）下断，代表风，长女，东南
                  }
                ]
              },
              shaoyang:{
                symbol:['---',//少阳，代表春，东，青龙
                        '- -'],
                children:[
                  {
                    symbol:['---','- -','---']//离中虚，代表火，中女，南
                  },
                  {
                    symbol:['---','- -', '- -']//艮（gen）覆碗，代表山，少男，东北
                  }
                ]
              }
            },
          ]
        },
      },
      { 
        yinyao:{
          symbol:'- -',//地，夜，女
          laoyin:{
            symbol:['- -',//老阴，代表冬，北，玄武
                    '- -'],
            children:[
              {
                symbol:['- -',
                        '- -',
                        '---']//震仰盂，代表雷，长男，东
              },
              {
                symbol:['- -',
                        '- -',
                        '- -']//坤六断，代表地，母，西南
              }
            ]
          },
          shaoyin:{
            symbol:['- -',//少阴，代表秋，西，白虎
                    '---'],
            children:[
              {
                symbol:['- -',
                        '---',
                        '---']//兑上缺，代表泽，少女，西
              },
              {
                symbol:['- -',
                        '---',
                        '- -']//坎中满 代表水，中男，北
              }
            ]
          }
        }
      } 
    ]

    
    
}